{"class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "bias_constraint": null, "recurrent_regularizer": null, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "return_state": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "bias_regularizer": null, "unit_forget_bias": true, "return_sequences": false, "activation": "hard_sigmoid", "stateful": true, "recurrent_dropout": 0.0, "recurrent_constraint": null, "units": 1000, "batch_input_shape": [1, 10, 50], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "recurrent_activation": "hard_sigmoid", "name": "lstm_4", "unroll": false, "dropout": 0.0, "go_backwards": false}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "units": 500, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Reshape", "config": {"name": "reshape_3", "target_shape": [10, 50], "trainable": true}}]}