{"backend": "tensorflow", "config": [{"config": {"recurrent_regularizer": null, "use_bias": true, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "implementation": 1, "dropout": 0.0, "units": 500, "kernel_constraint": null, "kernel_regularizer": null, "unroll": false, "batch_input_shape": [127, 10, 50], "go_backwards": false, "bias_constraint": null, "stateful": true, "return_state": false, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "name": "lstm_1", "recurrent_dropout": 0.2, "activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"recurrent_regularizer": null, "use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "implementation": 1, "dropout": 0.0, "units": 500, "kernel_constraint": null, "kernel_regularizer": null, "unroll": false, "go_backwards": false, "bias_constraint": null, "stateful": true, "return_state": false, "bias_regularizer": null, "return_sequences": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "lstm_2", "recurrent_dropout": 0.2, "activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"recurrent_regularizer": null, "use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "implementation": 1, "dropout": 0.0, "units": 500, "kernel_constraint": null, "kernel_regularizer": null, "unroll": false, "go_backwards": false, "bias_constraint": null, "stateful": true, "return_state": false, "bias_regularizer": null, "return_sequences": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "lstm_3", "recurrent_dropout": 0.2, "activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 500, "activation": "linear", "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "reshape_1", "trainable": true, "target_shape": [10, 50]}, "class_name": "Reshape"}], "keras_version": "2.2.2", "class_name": "Sequential"}